{"keras_version": "1.1.2", "config": [{"config": {"trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0017\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "output_shape": null, "input_dtype": "float32", "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "nb_filter": 24, "border_mode": "valid", "trainable": true, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "subsample": [2, 2], "bias": true, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_1", "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "nb_filter": 36, "border_mode": "valid", "trainable": true, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "subsample": [2, 2], "bias": true, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_2", "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "nb_filter": 48, "border_mode": "valid", "trainable": true, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "subsample": [2, 2], "bias": true, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_3", "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "nb_filter": 64, "border_mode": "valid", "trainable": true, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "subsample": [1, 1], "bias": true, "nb_col": 3, "activity_regularizer": null, "name": "convolution2d_4", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "nb_filter": 64, "border_mode": "valid", "trainable": true, "b_constraint": null, "init": "he_normal", "dim_ordering": "tf", "subsample": [1, 1], "bias": true, "nb_col": 3, "activity_regularizer": null, "name": "convolution2d_5", "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "output_dim": 1164, "trainable": true, "b_constraint": null, "init": "he_normal", "activity_regularizer": null, "input_dim": null, "bias": true, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "output_dim": 100, "trainable": true, "b_constraint": null, "init": "he_normal", "activity_regularizer": null, "input_dim": null, "bias": true, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "output_dim": 50, "trainable": true, "b_constraint": null, "init": "he_normal", "activity_regularizer": null, "input_dim": null, "bias": true, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "output_dim": 10, "trainable": true, "b_constraint": null, "init": "he_normal", "activity_regularizer": null, "input_dim": null, "bias": true, "name": "dense_4"}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null, "output_dim": 1, "trainable": true, "b_constraint": null, "init": "he_normal", "activity_regularizer": null, "input_dim": null, "bias": true, "name": "dense_5"}, "class_name": "Dense"}], "class_name": "Sequential"}