{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 3, "trainable": true, "W_regularizer": null, "border_mode": "same", "bias": true, "W_constraint": null, "input_dtype": "float32", "b_constraint": null, "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "activation": "linear", "nb_filter": 32, "subsample": [1, 1], "batch_input_shape": [null, 32, 32, 3], "b_regularizer": null, "nb_row": 3, "name": "convolution2d_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "trainable": true, "b_constraint": null, "border_mode": "valid", "bias": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "name": "convolution2d_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "trainable": true, "b_constraint": null, "border_mode": "same", "bias": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "nb_filter": 64, "activation": "linear", "activity_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "name": "convolution2d_3"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "trainable": true, "b_constraint": null, "border_mode": "valid", "bias": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "nb_filter": 64, "activation": "linear", "activity_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "nb_row": 3, "name": "convolution2d_4"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "output_dim": 512, "bias": true, "name": "dense_1", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "input_dim": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "output_dim": 1, "bias": true, "name": "dense_2", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "input_dim": null, "b_regularizer": null}}], "keras_version": "1.1.2"}