{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "gamma_regularizer": null, "beta_regularizer": null, "mode": 0, "input_dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "epsilon": 0.001, "momentum": 0.99, "trainable": true, "axis": -1}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "name": "convolution2d_1", "nb_col": 3, "W_regularizer": null, "nb_filter": 32, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "nb_row": 3, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "same", "b_regularizer": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "name": "convolution2d_2", "nb_col": 3, "W_regularizer": null, "nb_filter": 32, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "nb_row": 3, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "valid", "b_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "name": "convolution2d_3", "nb_col": 3, "W_regularizer": null, "nb_filter": 64, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "nb_row": 3, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "same", "b_regularizer": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "name": "convolution2d_4", "nb_col": 3, "W_regularizer": null, "nb_filter": 64, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "nb_row": 3, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "valid", "b_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "output_dim": 512, "activity_regularizer": null, "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "bias": true, "input_dim": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "output_dim": 1, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "bias": true, "input_dim": null, "trainable": true}}]}