{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "function_type": "lambda", "output_shape_type": "raw", "name": "lambda_1", "arguments": {}, "output_shape": null, "batch_input_shape": [null, 66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0017\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 5, "b_constraint": null, "subsample": [2, 2], "nb_row": 5, "nb_filter": 24, "init": "he_normal", "activation": "linear", "name": "convolution2d_1", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 5, "b_constraint": null, "subsample": [2, 2], "nb_row": 5, "nb_filter": 36, "init": "he_normal", "activation": "linear", "name": "convolution2d_2", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 5, "b_constraint": null, "subsample": [2, 2], "nb_row": 5, "nb_filter": 48, "init": "he_normal", "activation": "linear", "name": "convolution2d_3", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "b_constraint": null, "subsample": [1, 1], "nb_row": 3, "nb_filter": 64, "init": "he_normal", "activation": "linear", "name": "convolution2d_4", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_col": 3, "b_constraint": null, "subsample": [1, 1], "nb_row": 3, "nb_filter": 64, "init": "he_normal", "activation": "linear", "name": "convolution2d_5", "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "input_dim": null, "init": "he_normal", "activation": "linear", "name": "dense_1", "output_dim": 1164, "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "input_dim": null, "init": "he_normal", "activation": "linear", "name": "dense_2", "output_dim": 100, "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "input_dim": null, "init": "he_normal", "activation": "linear", "name": "dense_3", "output_dim": 50, "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "input_dim": null, "init": "he_normal", "activation": "linear", "name": "dense_4", "output_dim": 10, "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_9", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "input_dim": null, "init": "he_normal", "activation": "linear", "name": "dense_5", "output_dim": 1, "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "trainable": true}}], "keras_version": "1.1.2"}