{"keras_version": "1.2.0", "config": [{"config": {"output_shape_type": "raw", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0017\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "output_shape": null, "function_type": "lambda", "batch_input_shape": [null, 66, 200, 3], "trainable": true, "arguments": {}}, "class_name": "Lambda"}, {"config": {"init": "he_normal", "name": "convolution2d_1", "border_mode": "valid", "W_regularizer": null, "nb_row": 5, "bias": true, "subsample": [2, 2], "nb_col": 5, "W_constraint": null, "nb_filter": 24, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"init": "he_normal", "name": "convolution2d_2", "border_mode": "valid", "W_regularizer": null, "nb_row": 5, "bias": true, "subsample": [2, 2], "nb_col": 5, "W_constraint": null, "nb_filter": 36, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"init": "he_normal", "name": "convolution2d_3", "border_mode": "valid", "W_regularizer": null, "nb_row": 5, "bias": true, "subsample": [2, 2], "nb_col": 5, "W_constraint": null, "nb_filter": 48, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"init": "he_normal", "name": "convolution2d_4", "border_mode": "valid", "W_regularizer": null, "nb_row": 3, "bias": true, "subsample": [1, 1], "nb_col": 3, "W_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"init": "he_normal", "name": "convolution2d_5", "border_mode": "valid", "W_regularizer": null, "nb_row": 3, "bias": true, "subsample": [1, 1], "nb_col": 3, "W_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "bias": true, "output_dim": 1164, "W_constraint": null, "name": "dense_1", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "relu", "input_dim": 1152}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "bias": true, "output_dim": 100, "W_constraint": null, "name": "dense_2", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "relu", "input_dim": 1164}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "bias": true, "output_dim": 50, "W_constraint": null, "name": "dense_3", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "relu", "input_dim": 100}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "bias": true, "output_dim": 10, "W_constraint": null, "name": "dense_4", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "relu", "input_dim": 50}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "bias": true, "output_dim": 1, "W_constraint": null, "name": "dense_5", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "input_dim": 10}, "class_name": "Dense"}], "class_name": "Sequential"}