{"config": [{"config": {"dim_ordering": "tf", "nb_filter": 64, "W_regularizer": null, "trainable": true, "border_mode": "valid", "init": "glorot_uniform", "nb_row": 11, "batch_input_shape": [null, 160, 320, 3], "name": "convolution2d_1", "nb_col": 11, "b_constraint": null, "W_constraint": null, "activation": "linear", "input_dtype": "float32", "b_regularizer": null, "subsample": [4, 4], "activity_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"mode": 0, "beta_regularizer": null, "epsilon": 0.001, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_1", "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "pool_size": [3, 3], "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"dim_ordering": "tf", "nb_filter": 256, "W_regularizer": null, "trainable": true, "border_mode": "valid", "init": "glorot_uniform", "nb_row": 5, "bias": true, "name": "convolution2d_2", "nb_col": 5, "b_constraint": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "subsample": [1, 1], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"mode": 0, "beta_regularizer": null, "epsilon": 0.001, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_2", "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "pool_size": [3, 3], "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"dim_ordering": "tf", "nb_filter": 384, "W_regularizer": null, "trainable": true, "border_mode": "valid", "init": "glorot_uniform", "nb_row": 3, "bias": true, "name": "convolution2d_3", "nb_col": 3, "b_constraint": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "subsample": [1, 1], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"mode": 0, "beta_regularizer": null, "epsilon": 0.001, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_3", "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "nb_filter": 384, "W_regularizer": null, "trainable": true, "border_mode": "valid", "init": "glorot_uniform", "nb_row": 3, "bias": true, "name": "convolution2d_4", "nb_col": 3, "b_constraint": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "subsample": [1, 1], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"mode": 0, "beta_regularizer": null, "epsilon": 0.001, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_4", "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "nb_filter": 256, "W_regularizer": null, "trainable": true, "border_mode": "valid", "init": "glorot_uniform", "nb_row": 1, "bias": true, "name": "convolution2d_5", "nb_col": 1, "b_constraint": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "subsample": [1, 1], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"mode": 0, "beta_regularizer": null, "epsilon": 0.001, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_5", "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "output_dim": 4096, "input_dim": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "dense_1", "activation": "linear"}, "class_name": "Dense"}, {"config": {"mode": 0, "beta_regularizer": null, "epsilon": 0.001, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_6", "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.25, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "output_dim": 256, "input_dim": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "dense_2", "activation": "linear"}, "class_name": "Dense"}, {"config": {"mode": 0, "beta_regularizer": null, "epsilon": 0.001, "axis": -1, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_7", "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_7", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "output_dim": 1, "input_dim": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "dense_3", "activation": "linear"}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}