{"config": [{"config": {"input_dtype": "float32", "trainable": true, "function_type": "lambda", "name": "lambda_1", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0017\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "arguments": {}, "batch_input_shape": [null, 66, 200, 3]}, "class_name": "Lambda"}, {"config": {"subsample": [2, 2], "activity_regularizer": null, "name": "convolution2d_1", "W_regularizer": null, "dim_ordering": "tf", "bias": true, "trainable": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "init": "he_normal", "border_mode": "valid", "nb_row": 5, "b_constraint": null, "nb_filter": 24, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"subsample": [2, 2], "activity_regularizer": null, "name": "convolution2d_2", "W_regularizer": null, "dim_ordering": "tf", "bias": true, "trainable": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "init": "he_normal", "border_mode": "valid", "nb_row": 5, "b_constraint": null, "nb_filter": 36, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"subsample": [2, 2], "activity_regularizer": null, "name": "convolution2d_3", "W_regularizer": null, "dim_ordering": "tf", "bias": true, "trainable": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "init": "he_normal", "border_mode": "valid", "nb_row": 5, "b_constraint": null, "nb_filter": 48, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"subsample": [1, 1], "activity_regularizer": null, "name": "convolution2d_4", "W_regularizer": null, "dim_ordering": "tf", "bias": true, "trainable": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "init": "he_normal", "border_mode": "valid", "nb_row": 3, "b_constraint": null, "nb_filter": 64, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"subsample": [1, 1], "activity_regularizer": null, "name": "convolution2d_5", "W_regularizer": null, "dim_ordering": "tf", "bias": true, "trainable": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "init": "he_normal", "border_mode": "valid", "nb_row": 3, "b_constraint": null, "nb_filter": 64, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "name": "dense_1", "bias": true, "W_constraint": null, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 1164, "b_constraint": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "name": "dense_2", "bias": true, "W_constraint": null, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 100, "b_constraint": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "name": "dense_3", "bias": true, "W_constraint": null, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 50, "b_constraint": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "name": "dense_4", "bias": true, "W_constraint": null, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 10, "b_constraint": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "name": "dense_5", "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 1, "b_constraint": null, "input_dim": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}