{"config": [{"config": {"arguments": {}, "name": "lambda_1", "input_dtype": "float32", "output_shape": null, "batch_input_shape": [null, 66, 200, 3], "function_type": "lambda", "output_shape_type": "raw", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0017\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"init": "he_normal", "W_constraint": null, "bias": true, "subsample": [2, 2], "nb_row": 5, "b_constraint": null, "nb_filter": 24, "nb_col": 5, "b_regularizer": null, "activation": "linear", "name": "convolution2d_1", "trainable": true, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "he_normal", "W_constraint": null, "bias": true, "subsample": [2, 2], "nb_row": 5, "b_constraint": null, "nb_filter": 36, "nb_col": 5, "b_regularizer": null, "activation": "linear", "name": "convolution2d_2", "trainable": true, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "he_normal", "W_constraint": null, "bias": true, "subsample": [2, 2], "nb_row": 5, "b_constraint": null, "nb_filter": 48, "nb_col": 5, "b_regularizer": null, "activation": "linear", "name": "convolution2d_3", "trainable": true, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "he_normal", "W_constraint": null, "bias": true, "subsample": [1, 1], "nb_row": 3, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "b_regularizer": null, "activation": "linear", "name": "convolution2d_4", "trainable": true, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "he_normal", "W_constraint": null, "bias": true, "subsample": [1, 1], "nb_row": 3, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "b_regularizer": null, "activation": "linear", "name": "convolution2d_5", "trainable": true, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "he_normal", "W_constraint": null, "bias": true, "output_dim": 1164, "b_constraint": null, "b_regularizer": null, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "he_normal", "W_constraint": null, "bias": true, "output_dim": 100, "b_constraint": null, "b_regularizer": null, "activation": "linear", "name": "dense_2", "activity_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "he_normal", "W_constraint": null, "bias": true, "output_dim": 50, "b_constraint": null, "b_regularizer": null, "activation": "linear", "name": "dense_3", "activity_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "he_normal", "W_constraint": null, "bias": true, "output_dim": 10, "b_constraint": null, "b_regularizer": null, "activation": "linear", "name": "dense_4", "activity_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "elu_9", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "he_normal", "W_constraint": null, "bias": true, "output_dim": 1, "b_constraint": null, "b_regularizer": null, "activation": "linear", "name": "dense_5", "activity_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}