{"keras_version": "1.1.2", "config": [{"config": {"function_type": "lambda", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0019\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "trainable": true, "arguments": {}, "input_dtype": "float32", "output_shape": null}, "class_name": "Lambda"}, {"config": {"trainable": true, "border_mode": "valid", "nb_filter": 24, "nb_col": 5, "subsample": [2, 2], "name": "convolution2d_1", "W_constraint": null, "activation": "linear", "W_regularizer": null, "nb_row": 5, "b_constraint": null, "activity_regularizer": null, "bias": true, "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "border_mode": "valid", "nb_filter": 36, "nb_col": 5, "subsample": [2, 2], "name": "convolution2d_2", "W_constraint": null, "activation": "linear", "W_regularizer": null, "nb_row": 5, "b_constraint": null, "activity_regularizer": null, "bias": true, "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "border_mode": "valid", "nb_filter": 48, "nb_col": 5, "subsample": [2, 2], "name": "convolution2d_3", "W_constraint": null, "activation": "linear", "W_regularizer": null, "nb_row": 5, "b_constraint": null, "activity_regularizer": null, "bias": true, "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "border_mode": "valid", "nb_filter": 64, "nb_col": 3, "subsample": [1, 1], "name": "convolution2d_4", "W_constraint": null, "activation": "linear", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "activity_regularizer": null, "bias": true, "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "border_mode": "valid", "nb_filter": 64, "nb_col": 3, "subsample": [1, 1], "name": "convolution2d_5", "W_constraint": null, "activation": "linear", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "activity_regularizer": null, "bias": true, "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_1", "output_dim": 1164, "input_dim": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "init": "he_normal", "bias": true}, "class_name": "Dense"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_2", "output_dim": 100, "input_dim": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "init": "he_normal", "bias": true}, "class_name": "Dense"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_3", "output_dim": 50, "input_dim": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "init": "he_normal", "bias": true}, "class_name": "Dense"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_4", "output_dim": 10, "input_dim": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "init": "he_normal", "bias": true}, "class_name": "Dense"}, {"config": {"name": "elu_9", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_5", "output_dim": 1, "input_dim": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "init": "he_normal", "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}