{"keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "nb_col": 3, "W_constraint": null, "batch_input_shape": [null, 32, 32, 3], "activity_regularizer": null, "name": "convolution2d_1", "bias": true, "subsample": [1, 1], "activation": "linear", "input_dtype": "float32", "border_mode": "same", "b_regularizer": null, "nb_filter": 32, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "nb_col": 3, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "subsample": [1, 1], "activation": "linear", "border_mode": "valid", "nb_filter": 32, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "nb_col": 3, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "subsample": [1, 1], "activation": "linear", "border_mode": "same", "nb_filter": 64, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "nb_col": 3, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "bias": true, "subsample": [1, 1], "activation": "linear", "border_mode": "valid", "nb_filter": 64, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": null, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "name": "dense_1", "bias": true, "trainable": true, "output_dim": 512, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": null, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "name": "dense_2", "bias": true, "trainable": true, "output_dim": 1, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform"}}], "class_name": "Sequential"}