{"config": [{"config": {"gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "batch_input_shape": [null, 32, 32, 3], "axis": -1, "input_dtype": "float32", "epsilon": 0.001, "mode": 0, "name": "batchnormalization_1"}, "class_name": "BatchNormalization"}, {"config": {"bias": true, "b_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "name": "convolution2d_1", "nb_col": 3, "init": "glorot_uniform", "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"bias": true, "b_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "name": "convolution2d_2", "nb_col": 3, "init": "glorot_uniform", "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.25, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias": true, "b_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "name": "convolution2d_3", "nb_col": 3, "init": "glorot_uniform", "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"bias": true, "b_regularizer": null, "trainable": true, "activation": "relu", "nb_row": 3, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "name": "convolution2d_4", "nb_col": 3, "init": "glorot_uniform", "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.25, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias": true, "b_regularizer": null, "trainable": true, "activation": "relu", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "output_dim": 512, "init": "glorot_uniform", "name": "dense_1"}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"bias": true, "b_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "name": "dense_2"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}