{"config": [{"config": {"trainable": true, "input_dtype": "float32", "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "name": "batchnormalization_1", "epsilon": 0.001, "batch_input_shape": [null, 66, 200, 3], "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"subsample": [2, 2], "W_constraint": null, "name": "convolution2d_1", "W_regularizer": null, "bias": true, "border_mode": "valid", "b_constraint": null, "trainable": true, "nb_col": 5, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 24}, "class_name": "Convolution2D"}, {"config": {"subsample": [2, 2], "W_constraint": null, "name": "convolution2d_2", "W_regularizer": null, "bias": true, "border_mode": "valid", "b_constraint": null, "trainable": true, "nb_col": 5, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 36}, "class_name": "Convolution2D"}, {"config": {"subsample": [2, 2], "W_constraint": null, "name": "convolution2d_3", "W_regularizer": null, "bias": true, "border_mode": "valid", "b_constraint": null, "trainable": true, "nb_col": 5, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 48}, "class_name": "Convolution2D"}, {"config": {"subsample": [1, 1], "W_constraint": null, "name": "convolution2d_4", "W_regularizer": null, "bias": true, "border_mode": "valid", "b_constraint": null, "trainable": true, "nb_col": 3, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"subsample": [1, 1], "W_constraint": null, "name": "convolution2d_5", "W_regularizer": null, "bias": true, "border_mode": "valid", "b_constraint": null, "trainable": true, "nb_col": 3, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dim": null, "W_constraint": null, "name": "dense_1", "bias": true, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 1164, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dim": null, "W_constraint": null, "name": "dense_2", "bias": true, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 100, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dim": null, "W_constraint": null, "name": "dense_3", "bias": true, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 50, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dim": null, "W_constraint": null, "name": "dense_4", "bias": true, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 10, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dim": null, "W_constraint": null, "name": "dense_5", "bias": true, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "activation": "relu"}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}