{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "function_type": "lambda", "arguments": {}, "output_shape_type": "raw", "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "output_shape": null, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0017\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "name": "convolution2d_1", "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "nb_filter": 24, "nb_row": 5, "subsample": [2, 2], "b_constraint": null, "W_regularizer": null, "bias": true, "nb_col": 5, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "name": "convolution2d_2", "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "nb_filter": 36, "nb_row": 5, "subsample": [2, 2], "b_constraint": null, "W_regularizer": null, "bias": true, "nb_col": 5, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "name": "convolution2d_3", "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "nb_filter": 48, "nb_row": 5, "subsample": [2, 2], "b_constraint": null, "W_regularizer": null, "bias": true, "nb_col": 5, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "name": "convolution2d_4", "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "nb_filter": 64, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "bias": true, "nb_col": 3, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "name": "convolution2d_5", "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "nb_filter": 64, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "bias": true, "nb_col": 3, "activation": "linear"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": true, "output_dim": 1164, "b_constraint": null, "W_regularizer": null, "bias": true, "activation": "relu"}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": true, "output_dim": 100, "b_constraint": null, "W_regularizer": null, "bias": true, "activation": "relu"}}, {"class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": true, "output_dim": 50, "b_constraint": null, "W_regularizer": null, "bias": true, "activation": "relu"}}, {"class_name": "ELU", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": true, "output_dim": 10, "b_constraint": null, "W_regularizer": null, "bias": true, "activation": "relu"}}, {"class_name": "ELU", "config": {"name": "elu_9", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_5", "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": true, "output_dim": 1, "b_constraint": null, "W_regularizer": null, "bias": true, "activation": "linear"}}], "keras_version": "1.1.2"}