{"config": [{"config": {"arguments": {}, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0017\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "function_type": "lambda", "output_shape": null, "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3]}, "class_name": "Lambda"}, {"config": {"W_regularizer": null, "bias": true, "name": "convolution2d_1", "nb_col": 5, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 5, "W_constraint": null, "init": "he_normal", "dim_ordering": "tf", "trainable": true, "nb_filter": 24, "subsample": [2, 2], "border_mode": "valid", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "bias": true, "name": "convolution2d_2", "nb_col": 5, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 5, "W_constraint": null, "init": "he_normal", "dim_ordering": "tf", "trainable": true, "nb_filter": 36, "subsample": [2, 2], "border_mode": "valid", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "bias": true, "name": "convolution2d_3", "nb_col": 5, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 5, "W_constraint": null, "init": "he_normal", "dim_ordering": "tf", "trainable": true, "nb_filter": 48, "subsample": [2, 2], "border_mode": "valid", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "bias": true, "name": "convolution2d_4", "nb_col": 3, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 3, "W_constraint": null, "init": "he_normal", "dim_ordering": "tf", "trainable": true, "nb_filter": 64, "subsample": [1, 1], "border_mode": "valid", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "bias": true, "name": "convolution2d_5", "nb_col": 3, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 3, "W_constraint": null, "init": "he_normal", "dim_ordering": "tf", "trainable": true, "nb_filter": 64, "subsample": [1, 1], "border_mode": "valid", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_1", "trainable": true, "b_regularizer": null, "activation": "linear", "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "output_dim": 1164, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_2", "trainable": true, "b_regularizer": null, "activation": "linear", "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "output_dim": 100, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_3", "trainable": true, "b_regularizer": null, "activation": "linear", "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "output_dim": 50, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_4", "trainable": true, "b_regularizer": null, "activation": "linear", "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "output_dim": 10, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_5", "trainable": true, "b_regularizer": null, "activation": "linear", "init": "he_normal", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "output_dim": 1, "b_constraint": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}