{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "mode": 0, "batch_input_shape": [null, 32, 32, 3], "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "name": "batchnormalization_1", "input_dtype": "float32", "axis": -1}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "name": "convolution2d_1", "bias": true, "W_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 32, "init": "glorot_uniform", "nb_col": 3, "border_mode": "same", "b_constraint": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "name": "convolution2d_2", "bias": true, "W_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 32, "init": "glorot_uniform", "nb_col": 3, "border_mode": "valid", "b_constraint": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "name": "convolution2d_3", "bias": true, "W_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "init": "glorot_uniform", "nb_col": 3, "border_mode": "same", "b_constraint": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "W_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "trainable": true, "name": "convolution2d_4", "bias": true, "W_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "init": "glorot_uniform", "nb_col": 3, "border_mode": "valid", "b_constraint": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true, "name": "dense_1", "input_dim": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "output_dim": 512}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "activity_regularizer": null, "trainable": true, "name": "dense_2", "input_dim": null, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "output_dim": 1}}]}